announcements/now-thirty.org
* Key Insights 
  1. [[https://www.drdobbs.com:443/user-interface-a-means-to-an-end/184410453][User Interface is a means to an end]].
  2. Open Source is essential  for discovering new interaction paradigms.
  3. This is not mere idealism.  Openness is a key enabler for
     creating   user journeys that were not  envisioned by a 
     system's designers.
  4. [[https://www.gnu.org/s/emacs/][Emacs]] and  [[https://en.wikipedia.org/wiki/TeX][TeX]]    are good exemplars. They  permit maximal freedom
      when seen from the viewpoint of user extensibility and
     creativity. TeX enabled [[https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio_21.html][Audio System For Technical Readings (AsTeR)]]; Emacs enabled [[https://emacspeak.sourceforge.net][Emacspeak]].
  5. Rapid, reliable task completion is the most important metric and
     trumps secondary items such as eye-candy --- the latter only
     leads to bloat as evinced by the HTML Web.
  6. Having a well-identified  problem when designing a system
     is paramount.
  7. /Usability/ is important, but to  truly matter, the
     system needs to be /useful/.
  8. /Ease of use/ by   itself is often /marketing/ hype.
  9. Useful systems are fun to learn and give back more than what you put
     in with respect to time and effort.
  10. A steep learning curve in and of itself is not to be feared --- it
      can be fun to learn and  gets you farther faster.
  11. True empowerment: Ensure that the user grows continuously.



* Emacspeak --- The Complete Audio Desktop 

  1. Emacspeak, started in September 1994, was released as Open
   Source in [[https://tvraman.github.io/emacspeak//web/releases/release-3.0.html][April 1995]].
  2. The goal was to create a system for daily use that  doubled
     as a research work-bench for developing an auditory interface.
  3. Speech and auditory output would be  treated as 
     first-class citizens.
  4. The time felt right with respect to building a  system 
     that enabled  eyes-free access to the emerging Web.
  5. [[https://emacspeak.sourceforge.net/turning-twenty.html][Emacspeak At Twenty]]  was published in September 2014 and  traced the
     evolution of the project.
  6. Now, this article gives a birds-eye overview of the last 10 years
     by loosely following the logical structure of the  /Turning Twenty/ paper.
  7. In the process, we identify the dreams that have come to pass as
     well as the expectations that have failed to materialize --- *both*
     attributable  to developments in the larger Internet eco-system.
  8. But never fear, though  some of these
     may be   superficially
     disappointing, they likely herald the nature of bigger and better
     things to come!
  9. As a proof-point, in 1994, I could not have imagined the impact
     that the world of Internet-centered  computing and the accompanying
     information revolution would have  on the state of information
     access.
  10. Conversely, I boldly (and incorrectly) predicted that the
      arrival of mobile devices and mainstream speech interfaces would
      herald the move to a Web of information where there would be a
      clean separation between application back-ends and various
      client-specific front-ends. See [[https://emacspeak.sourceforge.net/raman/publications/specialized-browsers/][Specialized Browsers]] and [[http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=636][The
      Web, The Way You Want.  Distinguished Lecture Series, UW Oct 2007]].
  11. The above still makes sense from the view of  /scalable/ software architecture. However the rapid growth of the Web economy has also
      resulted in an even faster race to the bottom where applications
      continue to be built and re-built every few years for /the next
      best thing/ --- welcome to the /write once, debug everywhere/
      world all over again!
  12. Case in point; today we have smart phones, smart watches  and smart speakers,
      but each of these  require targeted front-ends  
      if one wishes to  bring the riches of the Internet to them.
  13. So the larger the Web gets, the fewer devices it becomes
      available  on --- a classic downward spiral.
      
Share And Enjoy --- [[https://tvraman.github.io/emacspeak/web/01-gemini.ogg][The Best Is Yet To Come]]!


** How To Read This Document

  1. I recommend reading the /Turning Twenty/ paper to get a full overview.
  2. Then, read this paper a section at a time, while referring back to
     the parallel section in the /Turning Twenty/ paper to understand
     how things have evolved.
  3. Make sure to skim or deep-dive into the references in both papers.
  
*  Using UNIX With Speech Output —  2024

  1. In 2024 /UNIX/ equates mostly to various Linux distributions, and from
    the Emacspeak perspective, they are all made /mostly/ equal.
  2. Variations do exist and  running bleeding-edge distributions can come
     with issues, /e.g./, unstable versions of the underlying audio infrastructure.
  3. Yes, 30 years and counting, Linux Audio is still a work in
     progress though I hope Pipewire will be the last of these tidal shifts.
  4. Linux is moving to Wayland  and expect that transition to
     be choppy.
  5.  Native applications are mostly gone bar
     the shouting. In this context, where most users access things
     through a /mainstream/ Web browser, Emacspeak users access
     /everything/ through Emacs.
  6. The above when  done right is hugely empowering; 
      when done badly, it's extremely limiting  --- see later
     sections of this paper on  the continuing evolution of the Web.
     
* Key Enabler — Emacs And Lisp Advice

  1. Advice in Emacs as implemented in ~advice~ is rock-solid.
  2. There is a newer ~nadvice~ that is part of Emacs that Emacspeak
     does not use.
     
  3. There are no plans to migrate to ~nadvice~ since that is a lot of
     busy work in my view and any such migration would be difficult
     to test for correctness.
  4. The classic /advice/ package may be removed from Emacs at some
     point in the future, but never fear; it'll be bundled with
     Emacspeak if that becomes necessary. This is a feature of Free Software and is a great
     example of what that /Freedom/ entails.
     
