announcements/now-thirty.tex
% Created 2024-07-26 Fri 20:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[scaled]{helvet} \renewcommand\familydefault{\sfdefault}
\input{.aster.tex}
\author{T.V Raman}
\date{Thursday, August 1, 2024}
\title{Emacspeak:  A Speech Odyssey}
\hypersetup{
 pdfauthor={T.V Raman},
 pdftitle={Emacspeak:  A Speech Odyssey},
 pdfkeywords={Emacspeak, Complete Audio Desktop},
 pdfsubject={Emacspeak  --- A Speech Odyssey --- Emacspeak At Thirty},
 pdfcreator={Emacs 31.0.50 (Org mode 9.7.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Key Insights}
\label{sec:org81f327b}
\begin{enumerate}
\item \href{https://www.drdobbs.com:443/user-interface-a-means-to-an-end/184410453}{User interface is a means to an end}.
\item Open Source is essential  for discovering new interaction paradigms.
\item This is not mere idealism.  Openness is a key enabler for
creating   user journeys that were not  envisioned by a 
system's designers.
\item \href{https://www.gnu.org/s/emacs/}{Emacs} and  \href{https://en.wikipedia.org/wiki/TeX}{\TeX{}}    are good exemplars. They  permit maximal freedom
 when seen from the viewpoint of user extensibility and
creativity. \TeX{} enabled \href{https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio\_21.html}{Audio System For Technical Readings (AsTeR)}; Emacs enabled \href{https://emacspeak.sourceforge.net}{Emacspeak}.
\item Rapid, reliable task completion is the most important metric and
trumps secondary items such as eye-candy --- the latter only
leads to bloat as evinced by the HTML Web.
\item Having a well-identified  problem when designing a system
is paramount.
\item \emph{Usability} is important, but to   matter, the
system needs to be \emph{useful} first.
\item \emph{Ease of use} by   itself is often \emph{marketing} hype.
\item Useful systems are fun to learn and give back more than what you put
in with respect to time and effort.
\item A steep learning curve in and of itself is not to be feared --- it
can be fun to learn and  gets you farther faster.
\item True empowerment: Ensure that the user grows continuously.
\end{enumerate}
\section{Emacspeak --- The Complete Audio Desktop}
\label{sec:orge5e354a}

\begin{enumerate}
\item Emacspeak, started in September 1994, was released as Open
Source in \href{https://tvraman.github.io/emacspeak//web/releases/release-3.0.html}{April 1995}.
\item The goal was to create a system for daily use that  doubled
as a research work-bench for developing an auditory interface.
\item Speech and auditory output would be  treated as 
first-class citizens.
\item The time felt right with respect to building a  system 
that enabled  eyes-free access to the emerging Web.
\item \href{https://emacspeak.sourceforge.net/turning-twenty.html}{Emacspeak At Twenty}  was published in September 2014 and  traced the
evolution of the project.
\item Now, this article gives a birds-eye overview of the last 10 years
by loosely following the logical structure of the  \emph{Turning Twenty} paper.
\item In the process, we identify the dreams that have come to pass as
well as the expectations that have failed to materialize --- \textbf{both}
attributable  to developments in the larger Internet eco-system.
\item But never fear, though  some of these
may be   superficially
disappointing, they likely herald the nature of bigger and better
things to come!
\item As a proof-point, in 1994, I could not have imagined the impact
that the world of Internet-centered  computing and the accompanying
information revolution would have  on the state of information
access.
\item Conversely, I boldly (and incorrectly) predicted that the
arrival of mobile devices and mainstream speech interfaces would
herald the move to a Web of information where there would be a
clean separation between application back-ends and various
client-specific front-ends. See \href{https://emacspeak.sourceforge.net/raman/publications/specialized-browsers/}{Specialized Browsers} and \href{http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=636}{The
Web, The Way You Want.  Distinguished Lecture Series, UW Oct 2007}.
\item The above still makes sense from the view of  \emph{scalable} software architecture. However the rapid growth of the Web economy has also
resulted in an even faster race to the bottom where applications
continue to be built and re-built every few years for \emph{the next
best thing} --- welcome to the \emph{write once, debug everywhere}
world all over again!
\item Case in point; today we have smart phones, smart watches  and smart speakers,
but each of these  require targeted front-ends  
if one wishes to  bring the riches of the Internet to them.
\item So the larger the Web gets, the fewer devices it becomes
available  on --- a classic downward spiral.
\end{enumerate}

Share And Enjoy --- \href{https://tvraman.github.io/emacspeak/web/01-gemini.ogg}{The Best Is Yet To Come}!
\subsection{How To Read This Document}
\label{sec:org2cefb9e}

\begin{enumerate}
\item I recommend reading the \emph{Turning Twenty} paper to get a full overview.
\item Then, read this paper a section at a time, while referring back to
the parallel section in the \emph{Turning Twenty} paper to understand
how things have evolved.
\item Make sure to skim or deep-dive into the references in both papers.
\end{enumerate}
\section{Using UNIX With Speech Output —  2024}
\label{sec:org5f6012e}

\begin{enumerate}
\item In 2024 \emph{UNIX} equates mostly to various Linux distributions, and from
the Emacspeak perspective, they are all made \emph{mostly} equal.
\item Variations do exist and  running bleeding-edge distributions can come
with issues, \emph{e.g.}, unstable versions of the underlying audio infrastructure.
\item Yes, 30 years and counting, Linux Audio is still a work in
progress though I hope Pipewire will be the last of these tidal shifts.
\item Linux is moving to Wayland  and expect that transition to
be choppy.
\item Native applications are mostly gone bar
the shouting. In this context, where most users access things
through a \emph{mainstream} Web browser, Emacspeak users access
\emph{everything} through Emacs.
\item The above when  done right is hugely empowering; 
 when done badly, it's extremely limiting  --- see later
sections of this paper on  the continuing evolution of the Web.
\end{enumerate}
\section{Key Enabler — Emacs And Lisp Advice}
\label{sec:org9363e13}

\begin{enumerate}
\item Advice in Emacs as implemented in \texttt{advice} is rock-solid.
\item There is a newer \texttt{nadvice} that is part of Emacs that Emacspeak
does not use.

\item There are no plans to migrate to \texttt{nadvice} since that is a lot of
busy work in my view and any such migration would be difficult
to test for correctness.
\item The classic \emph{advice} package may be removed from Emacs at some
point in the future, but never fear; it'll be bundled with
Emacspeak if that becomes necessary. This is a feature of Free Software and is a great
example of what that \emph{Freedom} entails.
\end{enumerate}
