announcements/now-thirty.org
* Key Component —  Text To Speech (TTS)

  1. Speech output --- especially unencumbered text-to-speech --- is just
    as much a challenge as it was 30 years ago.
  2. In the bigger picture, early instances of using TTS for voice
     assistants has driven the industry toward /natural sounding/ voices.
  3. The above sounds attractive on the surface, but a price we have
     paid is the  loss of fine-grained control over voice parameters,
     emotion, stress and other supra-linguistic features.
  4. I  believe  these to be essential for delivering
     good auditory interfaces and   remain optimistic that
     these will indeed arrive in a future iteration of speech
     interaction.
  5. Things appear to be coming full circle, Emacspeak started with
     the hardware Dectalk; now, the [[https://github.com/dectalk/dectalk.git][Software Dectalk]] is increasingly
     becoming the primary choice on Linux --- see this  [[https://raw.githubusercontent.com/tvraman/emacspeak/master/servers/software-dtk/Readme.org][Readme for setup instructions]].
  6. Viavoice Outloud from Voxin is still supported.  However,
     you can no longer buy new licenses. If you have already purchased
     a license, it'll
     continue to work.
  7. The  Vocalizer voices that Voxin now sells /do not/ work with Emacspeak.
  8. The  other choice on Linux is ESpeak which will hopefully
     continue to be free --- albeit of much lower quality.
  9. The future as ever is unpredictable and new voices may well show
     up --- especially those powered by on-device Large Language
     Models (LLMs).
     
  10. On non-free platforms, there is usable TTS on the Mac, now
      supported by the new SwiftMac server for Emacspeak.
     
* Emacspeak And Software Development

  1. /Magit/  as a Git porcelain is perhaps the biggest leap forward
   with respect to software development.
  2. New completion frameworks such as /company/ and /consult/ come a
     close second in enhancing productivity.
  3. Completion strategies such as  /fuzzy/ and
   /flex/ provide  enhanced completion.
  4. [[https://emacspeak.blogspot.com/2018/06/effective-suggest-and-complete-in-eyes.html][Effective Suggest And Complete In An Eyes-free Environment]]
     explains the higher-level concept  involved in defining such strategies.
  
  5. The ability to introspect code via  ~eglot~ 
      turn Emacs into a powerful and meaningful IDE ---  I say
     meaningful because this bring the best features of an integrated
     development environment while leaving behind the eye-candy that
     tends to bloat commercial IDEs.
  6. Packages like /transient/  enable discoverable, rapid keyboard access to
     complex nested-menu driven interfaces.
  7. [[https://emacspeak.blogspot.com/2023/09/emacs-ergonomics-dont-punish-your.html][Ergonomic keybindings]] under ~X~ using [[https://github.com/alols/xcape][xcape]] to minimize
     chording has been  a significant win in the last two years.
  8. Jupyter is the   generalization of IPython notebooks to /Julia/, /Python/
     and /R/. The news here isn't all good; IPython notebooks are
     well-designed with respect to not getting locked into any given
     implementation. However in practice,  front-ends
     depend on Javascript in the  browser.
  9. Consequently,  Emacs  packages  for IPython
     Notebooks /e.g./, package ~ein~,  are no longer maintained. 
  10. Developing in higher-level languages continues to be very well
      supported in Emacspeak.
  11. The re-emergence of Common Lisp in the last 20 years, thanks to
      [[https://asdf.common-lisp.dev/asdf.html][asdf]] and [[https://www.quicklisp.org/][quicklisp]] as a network-aware package manager and build
      tool has once again made Lisp development using Emacs ~Slime~ a
      productive experience.
  12. In 2022, I updated [[https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio_21.html][Audio System For Technical
      Readings (AsTeR)]]--- my PhD project from 1993 --- to run under ~SBCL~
      with a freshly implemented Emacs front-end.
  13. So now I can listen to Math content just as well as I could 30
      years ago!
     
     
* Emacspeak And Authoring Documents

  1. Package ~org~ is to authoring as ~magit~ is to
    software development with respect  to productivity gains.
  2. ~Org~ has existed since circa 2006 in my Emacs setup; but it
     continues to give and give plentifully.
  3. Where I once authored technical papers in /LaTeX/ using ~auctex~,
     used ~nxml~ for
     HTML,  /etc./, I now mostly write everything in ~org-mode~ and export
     to the relevant target format.
  4. Integrating various search engines  in Emacs makes authoring content extremely productive.
  5. Integrated access to spell-checking (~flyspell~) dictionaries, translation engines, and other
     language tools combine for a powerful authoring work-bench.
  6. Extending ~org-mode~ with custom link types enables /smart note
     taking/ with hyperlinks to relevant portions of an audio stream
     --- see article [[https://emacspeak.blogspot.com/2022/10/learn-smarter-by-taking-rich-hypertext.html][Learn Smarter By Taking Rich Hypertext Notes]].
     
     
