announcements/now-thirty.tex
\section{Key Component —  Text To Speech (TTS)}
\label{sec:org8aca920}

\begin{enumerate}
\item Speech output --- especially unencumbered text-to-speech --- is just
as much a challenge as it was 30 years ago.
\item In the bigger picture, early instances of using TTS for voice
assistants has driven the industry toward \emph{natural sounding} voices.
\item The above sounds attractive on the surface, but a price we have
paid is the  loss of fine-grained control over voice parameters,
emotion, stress and other supra-linguistic features.
\item I  believe  these to be essential for delivering
good auditory interfaces and   remain optimistic that
these will indeed arrive in a future iteration of speech
interaction.
\item Things appear to be coming full circle, Emacspeak started with
the hardware Dectalk; now, the \href{https://github.com/dectalk/dectalk.git}{Software Dectalk} is increasingly
becoming the primary choice on Linux --- see this  \href{https://raw.githubusercontent.com/tvraman/emacspeak/master/servers/software-dtk/Readme.org}{Readme for setup instructions}.
\item Viavoice Outloud from Voxin is still supported.  However,
you can no longer buy new licenses. If you have already purchased
a license, it'll
continue to work.
\item The  Vocalizer voices that Voxin now sells \emph{do not} work with Emacspeak.
\item The  other choice on Linux is ESpeak which will hopefully
continue to be free --- albeit of much lower quality.
\item The future as ever is unpredictable and new voices may well show
up --- especially those powered by on-device Large Language
Models (LLMs).

\item On non-free platforms, there is usable TTS on the Mac, now
supported by the new SwiftMac server for Emacspeak.
\end{enumerate}
\section{Emacspeak And Software Development}
\label{sec:orgd73a8b6}

\begin{enumerate}
\item \emph{Magit}  as a Git porcelain is perhaps the biggest leap forward
with respect to software development.
\item New completion frameworks such as \emph{company} and \emph{consult} come a
close second in enhancing productivity.
\item Completion strategies such as  \emph{fuzzy} and
\emph{flex} provide  enhanced completion.
\item \href{https://emacspeak.blogspot.com/2018/06/effective-suggest-and-complete-in-eyes.html}{Effective Suggest And Complete In An Eyes-free Environment}
explains the higher-level concept  involved in defining such strategies.

\item The ability to introspect code via  \texttt{eglot} 
 turn Emacs into a powerful and meaningful IDE ---  I say
meaningful because this brings the best features of an integrated
development environment while leaving behind the eye-candy that
tends to bloat commercial IDEs.
\item Packages like \emph{transient}  enable discoverable, rapid keyboard access to
complex nested-menu driven interfaces.
\item \href{https://emacspeak.blogspot.com/2023/09/emacs-ergonomics-dont-punish-your.html}{Ergonomic keybindings} under \texttt{X} using \href{https://github.com/alols/xcape}{xcape} to minimize
chording has been  a significant win in the last two years.
\item Jupyter is the   generalization of IPython notebooks to \emph{Julia}, \emph{Python}
and \emph{R}. The news here isn't all good; IPython notebooks are
well-designed with respect to not getting locked into any given
implementation. However in practice,  front-ends
depend on Javascript in the  browser.
\item Consequently,  Emacs  packages  for IPython
Notebooks \emph{e.g.}, package \texttt{ein},  are no longer maintained.
\item Developing in higher-level languages continues to be very well
supported in Emacspeak.
\item The re-emergence of Common Lisp in the last 20 years, thanks to
\href{https://asdf.common-lisp.dev/asdf.html}{asdf} and \href{https://www.quicklisp.org/}{quicklisp} as a network-aware package manager and build
tool has once again made Lisp development using Emacs \texttt{Slime} a
productive experience.
\item In 2022, I updated \href{https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio\_21.html}{Audio System For Technical
Readings (AsTeR)}--- my PhD project from 1993 --- to run under \texttt{SBCL}
with a freshly implemented Emacs front-end.
\item So now I can listen to Math content just as well as I could 30
years ago!
\end{enumerate}
\section{Emacspeak And Authoring Documents}
\label{sec:orgc910156}

\begin{enumerate}
\item Package \texttt{org} is to authoring as \texttt{magit} is to
software development with respect  to productivity gains.
\item \texttt{Org} has existed since circa 2006 in my Emacs setup; but it
continues to give and give plentifully.
\item Where I once authored technical papers in \emph{\LaTeX{}} using \texttt{auctex},
used \texttt{nxml} for
HTML,  \emph{etc.}, I now mostly write everything in \texttt{org-mode} and export
to the relevant target format.
\item Integrating various search engines  in Emacs makes authoring content extremely productive.
\item Integrated access to spell-checking (\texttt{flyspell}) dictionaries, translation engines, and other
language tools combine for a powerful authoring work-bench.
\item Extending \texttt{org-mode} with custom link types enables \emph{smart note
taking} with hyperlinks to relevant portions of an audio stream
--- see article \href{https://emacspeak.blogspot.com/2022/10/learn-smarter-by-taking-rich-hypertext.html}{Learn Smarter By Taking Rich Hypertext Notes}.
\end{enumerate}
