announcements/now-thirty.org
* Emacspeak  And The Web In 2024


  1. Package ~shr~ and ~eww~ arrived around 2014. But in 2024, they
    can be said to have *truly* landed.
  2. 2014 also  marked the explicit take-over of the stewardship of the HTML Web by the
     browser vendors from the W3C  --- I say
     explicit ---  because the W3C had already thrown in the towel in the
     preceding decade.
  3. This  has led to a Web of content  created using the assembly
     language of divs, spans and Javascript  under the flag of HTML5 ---
     the result is a tangled web of spaghetti that everyone loves to hate. 
  4. In this context, see [[https://idlewords.com/talks/website_obesity.htm][Tag Soup, Scripts And Obfuscation: How The
     Web Was Broken]] for  a good overview of  HTML's obesity problem.
  5. For better or worse, the investment in XML and display-independent
     content is now a complete write-off at least on the surface.

  6. So what next --- wait for the spaghetti monster to show up for
     lunch? Humor aside that monster may well be called AI ---  though
     whether  today's Web gives that monster life, indigestion,
     constipation,   dysentery or hallucinations  is a story to be
     written in the coming years.
     
  7.  I say /on the surface/ above  because The welcome re-emergence of
     ~ATOM~ and ~RSS~ feeds is perhaps a silent acknowledgement that
     bloated Web pages are now unusable even for users who can see.
  8.   Package  ~elfeed~ has emerged as  a powerful feed-manager for Emacs.
  9. Emacspeak implements  ~RSS~ and ~ATOM~ support using
     ~XSLT~;  those features now shine brighter  with mainstream
     news  sites reviving their support for content feeds.
  10. Browsers like Mozilla now implement /content filters/ --- a
      euphemism for scraping off  visual eye-candy and related cruft to
      reveal the underlying content.  These are now 
      available as  plugins, (see [[https://github.com/eafer/rdrview][RDRView]] for an example).  Emacspeak 
      leverages this to make the Web more readable.
  11. Package ~url-template~ and ~emacspeak-websearch~ continue to give
      in plenty, though they do require continuous updating.
  12. Web APIs come and go, so 
       that space is in  a state of constant change.
  13. The state of web applications is perhaps the most concerning from an
      Emacspeak perspective, and I do not  see that changing in the
      short-term.  There are no incentives for Web providers to
      free their applications from the tangled Web of spaghetti they have woven
      around themselves.
  14. But as with everything else in our industry,
      it is precisely when something feels completely entrenched that users
      rebel and innovations emerge  to move us to the next phase --- so
      fingers crossed.
  

* Audio Formatting —  Generalizing Aural CSS

  1. Audio formatting with Aural CSS support is stable, with new
     enhancements supporting more TTS engines.
  2. Support for parallel streams of TTS using separate outputs to
     left/right channels is a big win and enables more efficient interaction.
  3. Support for various Digital Signal Processing (DSP)  filters enables   rich auditory effects
     like  binaural audio and spatial audio.
  4. [[https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html][Soundscapes]] implemented via package ~boodler~ makes for  a
     pleasant and relaxing auditory environment.
  5. Enabling virtual sound devices via Pipewire for 5.1  and 7.1
     spatial audio significantly enhances the auditory experience.

     
* Conversational Gestures For The Audio Desktop

  1. Parallel streams of audio, combined with more ergonomic
    keybindings are  the primary  enhancement in this area.
  2. Parallel streams of speech, /e.g./, a separate notification
     stream on the left or right ear  help increase the band-width of communication.
  3. Notifications can thus be delivered without having to stop the
     primary speech output.
     
* Accessing Media Streams


  1. Emacspeak support for rich multimedia is now much  more robust.
  2. Emacs package   ~empv~  is a
     powerful tool  for locating, organizing  and playing local and remote
     media streams ranging from music, audio books, radio stations and
     Podcasts.
  3. This makes media streams from a large number of providers ranging
     from the BBC to Youtube available via a consistent keyboard interface.
  4. This experience is augmented by a collection of /smart/ content
     locators on the Emacspeak desktop, see the relevant blog
     article titled 
     [[https://emacspeak.blogspot.com/2024/03/updated-smart-media-selector-for-audio.html][smart media selectors]].
     
* Electronic Books—   Ubiquitous Access To Books

  1. Emacspeak modules  for /Epub/ and 
    /Bookshare/ continue to provide good books  integration.
  2. There are  /smart/ book locators analogous to the locators for
     media content.
  3. Emacspeak speech-enables ~Calibre~  for working with
     local electronic libraries.
     
     
* Leveraging Computational Tools —  From SQL And R To IPython Notebooks

  1. This area continues to provide a rich collection of  packages.
  2. Newer highlights include ~sage~ interaction for symbolic computation.
  3. Emacspeak speech-enables  packages  ~gptel~ and ~ellama~ for working
     with local and network LLMs.

     
* Social Web  — Mail, Messaging And Blogging  

  1. This is a space that is definitely regressing.
  2. The previous decade was marked by open APIs to many social Web platforms.
  3. Over time these first regressed with respect to privacy.
  4. Then they turned into wall-gardens in their own right.
  5. Finally, the Web APIs, other than the kind embedded in Javascript have
     started disappearing.
  6. Looking back, the only /social/ platform I now use is Blogger for
     hosting my Emacspeak Blog, it has a somewhat usable API, albeit
     guarded by a difficult to use /OAuth/ interface that requires 
     signing   in via  a /mainstream/ browser.
  7. IMap continues to survive as an open email protocol, though its
     days may well be numbered.
  8. The dye is already cast with respect to mere mortals being able
     to setup and  host their email ---  witness the complexity in setting
     up the Emacspeak mailing list in 2023 vs 1993!
  9. This is an area that is  likely to get worse before it gets
     better,  thanks to the spammers  --- more the pity, since Internet Email is perhaps the
     single-most impactful technology with respect to leveling the
     communications playing field.
  10. The disappearance of APIs mentioned above also means that today
      the only usable chat service on an open platform like Emacspeak
      is the venerable  Internet Relay Chat (IRC).
     
* The RESTful Web —  Web Wizards And URL Templates For Faster Access

  1. This area continues to thrive --- either because of --- or
    despite --- the best and worst efforts of application providers on the
    Web.
  2. Twenty years on (this feature originally landed in 2000)
     Emacspeak has a far richer collection of filters, preprocessors
     and post-processors
      that enables ever-more powerful Web
     wizards. See the relevant [[https://tvraman.github.io/emacspeak/manual/URL-Templates.html][chapter]] in the Emacspeak manual for the
     automatically updated list of *URL Templates*.
     
