announcements/now-thirty.tex
\section{Emacspeak  And The Web In 2024}
\label{sec:org8608813}


\begin{enumerate}
\item Package \texttt{shr} and \texttt{eww} arrived around 2014. But in 2024, they
can be said to have \textbf{truly} landed.
\item 2014 also  marked the explicit take-over of the stewardship of the HTML Web by the
browser vendors from the W3C  --- I say
explicit ---  because the W3C had already thrown in the towel in the
preceding decade.
\item This  has led to a Web of content  created using the assembly
language of divs, spans and Javascript  under the flag of HTML5 ---
the result is a tangled web of spaghetti that everyone loves to hate.
\item In this context, see \href{https://idlewords.com/talks/website\_obesity.htm}{Tag Soup, Scripts And Obfuscation: How The
Web Was Broken} for  a good overview of  HTML's obesity problem.
\item For better or worse, the investment in XML and display-independent
content is now a complete write-off at least on the surface.

\item So what next --- wait for the spaghetti monster to show up for
lunch? Humor aside that monster may well be called AI ---  though
whether  today's Web gives that monster life, indigestion,
constipation,   dysentery or hallucinations  is a story to be
written in the coming years.

\item I say \emph{on the surface} above  because The welcome re-emergence of
\texttt{ATOM} and \texttt{RSS} feeds is perhaps a silent acknowledgement that
bloated Web pages are now unusable even for users who can see.
\item Package  \texttt{elfeed} has emerged as  a powerful feed-manager for Emacs.
\item Emacspeak implements  \texttt{RSS} and \texttt{ATOM} support using
\texttt{XSLT};  those features now shine brighter  with mainstream
news  sites reviving their support for content feeds.
\item Browsers like Mozilla now implement \emph{content filters} --- a
euphemism for scraping off  visual eye-candy and related cruft to
reveal the underlying content.  These are now 
available as  plugins, (see \href{https://github.com/eafer/rdrview}{RDRView} for an example).  Emacspeak 
leverages this to make the Web more readable.
\item Package \texttt{url-template} and \texttt{emacspeak-websearch} continue to give
in plenty, though they do require continuous updating.
\item Web APIs come and go, so 
that space is in  a state of constant change.
\item The state of web applications is perhaps the most concerning from an
Emacspeak perspective, and I do not  see that changing in the
short-term.  There are no incentives for Web providers to
free their applications from the tangled Web of spaghetti they have woven
around themselves.
\item But as with everything else in our industry,
it is precisely when something feels completely entrenched that users
rebel and innovations emerge  to move us to the next phase --- so
fingers crossed.
\end{enumerate}
\section{Audio Formatting —  Generalizing Aural CSS}
\label{sec:orgbc1247b}

\begin{enumerate}
\item Audio formatting with Aural CSS support is stable, with new
enhancements supporting more TTS engines.
\item Support for parallel streams of TTS using separate outputs to
left/right channels is a big win and enables more efficient interaction.
\item Support for various Digital Signal Processing (DSP)  filters enables   rich auditory effects
like  binaural audio and spatial audio.
\item \href{https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html}{Soundscapes} implemented via package \texttt{boodler} makes for  a
pleasant and relaxing auditory environment.
\item Enabling virtual sound devices via Pipewire for 5.1  and 7.1
spatial audio significantly enhances the auditory experience.
\end{enumerate}
\section{Conversational Gestures For The Audio Desktop}
\label{sec:org95432b2}

\begin{enumerate}
\item Parallel streams of audio, combined with more ergonomic
keybindings are  the primary  enhancement in this area.
\item Parallel streams of speech, \emph{e.g.}, a separate notification
stream on the left or right ear  help increase the band-width of communication.
\item Notifications can thus be delivered without having to stop the
primary speech output.
\end{enumerate}
\section{Accessing Media Streams}
\label{sec:org2abf301}


\begin{enumerate}
\item Emacspeak support for rich multimedia is now much  more robust.
\item Emacs package   \texttt{empv}  is a
powerful tool  for locating, organizing  and playing local and remote
media streams ranging from music, audio books, radio stations and
Podcasts.
\item This makes media streams from a large number of providers ranging
from the BBC to Youtube available via a consistent keyboard interface.
\item This experience is augmented by a collection of \emph{smart} content
locators on the Emacspeak desktop, see the relevant blog
article titled 
\href{https://emacspeak.blogspot.com/2024/03/updated-smart-media-selector-for-audio.html}{smart media selectors}.
\end{enumerate}
\section{Electronic Books—   Ubiquitous Access To Books}
\label{sec:org2f32488}

\begin{enumerate}
\item Emacspeak modules  for \emph{Epub} and 
\emph{Bookshare} continue to provide good books  integration.
\item There are  \emph{smart} book locators analogous to the locators for
media content.
\item Emacspeak speech-enables \texttt{Calibre}  for working with
local electronic libraries.
\end{enumerate}
\section{Leveraging Computational Tools —  From SQL And R To IPython Notebooks}
\label{sec:org0353173}

\begin{enumerate}
\item This area continues to provide a rich collection of  packages.
\item Newer highlights include \texttt{sage} interaction for symbolic computation.
\item Emacspeak speech-enables  packages  \texttt{gptel} and \texttt{ellama} for working
with local and network LLMs.
\end{enumerate}
\section{Social Web  — Mail, Messaging And Blogging}
\label{sec:orgdc568b3}

\begin{enumerate}
\item This is a space that is definitely regressing.
\item The previous decade was marked by open APIs to many social Web platforms.
\item Over time these first regressed with respect to privacy.
\item Then they turned into wall-gardens in their own right.
\item Finally, the Web APIs, other than the kind embedded in Javascript have
started disappearing.
\item Looking back, the only \emph{social} platform I now use is Blogger for
hosting my Emacspeak Blog, it has a somewhat usable API, albeit
guarded by a difficult to use \emph{OAuth} interface that requires 
signing   in via  a \emph{mainstream} browser.
\item IMap continues to survive as an open email protocol, though its
days may well be numbered.
\item The dye is already cast with respect to mere mortals being able
to setup and  host their email ---  witness the complexity in setting
up the Emacspeak mailing list in 2023 vs 1993!
\item This is an area that is  likely to get worse before it gets
better,  thanks to the spammers  --- more's  the pity, since Internet Email is perhaps the
single-most impactful technology with respect to leveling the
communications playing field.
\item The disappearance of APIs mentioned above also means that today
the only usable chat service on an open platform like Emacspeak
is the venerable  Internet Relay Chat (IRC).
\end{enumerate}
\section{The RESTful Web —  Web Wizards And URL Templates For Faster Access}
\label{sec:orgaf444e5}

\begin{enumerate}
\item This area continues to thrive --- either because of --- or
despite --- the best and worst efforts of application providers on the
Web.
\item Twenty years on (this feature originally landed in 2000)
Emacspeak has a far richer collection of filters, preprocessors
and post-processors
 that enables ever-more powerful Web
wizards. See the relevant \href{https://tvraman.github.io/emacspeak/manual/URL-Templates.html}{chapter} in the Emacspeak manual for the
automatically updated list of \textbf{URL Templates}.
\end{enumerate}
