announcements/now-thirty.org
* Mashing It Up —  Leveraging  AI And The Web 

  1. Developing solutions by combining various API-based services on
     the Web has all but disappeared, unless one is willing to commit
     fully to the Javascript-powered Web hosted in a Web browser,
     something I hope I never have to accept.
  2. So for now, I'll keep
     well away and count my blessings.
  3. The next chapter of the /mash-up story/ may well be based around
      /Generative AI/ using LLMs. In effect, LLMs trained on   Web content 
     define a /platform/ for generating content mash-ups.  The issue
     at present is that they are just as  likely  to produce
     /meaningless mush/ ---
     something that may  get better as the field gets a
     handle on cleaning up  Web content.
  4.  Notice that we are now back to the previously unsolved problem
     of cleaning up the  HTML Web --- with LLMs, we'll just
     have an order of magnitude more documents than the /2^W/ postulated
      by  [[https://research.google/blog/beyond-web-20/?hl=in&m=1][Beyond Web 2.0, Communications
     Of The ACM, 2009]].
     
     
*  The Final Word --- Donald E Knuth (DEK)

  - The best theory is inspired by practice. The best practice is
    inspired by theory. 
  - The enjoyment of one's tools is an essential ingredient of
    successful work. 
  - Easy things are often amusing and relaxing, but their value soon
    fades. Greater pleasure, deeper satisfaction, and higher wages are
    associated with genuine accomplishments, with the successful
    fulfillment of a challenging task. 
  - [[https://www.azquotes.com/author/8177-Donald_Knuth][Computer Programming Is An Art]].
    
The best example of the above is of course [[https://en.wikipedia.org/wiki/TeX][Knuth's TeX]] --- work that
    was motivated  by his own dissatisfaction with the tools available
    to him at the time for typesetting    his magnum opus --- [[https://www-cs-faculty.stanford.edu/~knuth/taocp.html][The Art
    Of Computer Programming (TAOCP)]].  It is something I've looked up
    to ever since my time as a graduate student at Cornell.

    
The  Emacspeak Speech Odyssey outlined in this paper is, in some
small measure, my own personal
experience of the sentiments he expresses.

--T. V. Raman,  San Jose, CA, August 1, 2024.
    
* References

  1. [[https://www.drdobbs.com:443/user-interface-a-means-to-an-end/184410453][User Interface is a means to an end]].
  2. [[https://www.gnu.org/s/emacs/][GNU Emacs]]
  3. [[https://en.wikipedia.org/wiki/TeX][Knuth's TeX]]
  4. [[https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio_21.html][Audio System For Technical Readings]]
  5. [[https://tvraman.github.io/emacspeak//web/releases/release-3.0.html][Announcing Emacspeak: April 1995]]
  6. [[https://emacspeak.sourceforge.net/turning-twenty.html][Emacspeak At Twenty]]
  7. [[http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=636][The Web, The Way You Want.  Distinguished Lecture Series, UW Oct 2007]]
  8. [[https://emacspeak.sourceforge.net/raman/publications/specialized-browsers/][Specialized Browsers]]
  9. [[https://tvraman.github.io/emacspeak/web/01-gemini.ogg][An Ode To Emacspeak: The Best Is Yet To Come]]
  10. [[https://github.com/dectalk/dectalk.git][Software Dectalk on Github]]
  11. [[https://raw.githubusercontent.com/tvraman/emacspeak/master/servers/software-dtk/Readme.org][Dectalk  setup instructions]]
  12. [[https://emacspeak.blogspot.com/2018/06/effective-suggest-and-complete-in-eyes.html][Effective Suggest And Complete In An Eyes-free Environment]]
  13. [[https://asdf.common-lisp.dev/asdf.html][Common Lisp: asdf]]
  14. [[https://www.quicklisp.org/][Common Lisp: Quicklisp]]
  15. [[https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html][Soundscapes on the Emacspeak Audio Desktop]] 
  16. [[https://en.wikipedia.org/wiki/REST][RESTful Web]]
  17. [[https://emacspeak.blogspot.com/2023/09/emacs-ergonomics-dont-punish-your.html][Ergonomic keybindings]]
  18. [[https://github.com/alols/xcape][Minimize chording with XCape]]
  19. [[https://emacspeak.blogspot.com/2022/10/learn-smarter-by-taking-rich-hypertext.html][Learn Smarter By Taking Rich Hypertext Notes]]
  20. [[https://idlewords.com/talks/website_obesity.htm][Tag Soup, Scripts And Obfuscation: How The Web Was Broken]]
  21. [[https://github.com/eafer/rdrview][Readable Web Pages: RDRView]]
  22. [[https://emacspeak.blogspot.com/2024/03/updated-smart-media-selector-for-audio.html][smart media selectors]]
  23. [[https://research.google/blog/beyond-web-20/?hl=in&m=1][Beyond Web 2.0, Communications Of The ACM, 2009]]
  24. [[https://tvraman.github.io/emacspeak/manual/URL-Templates.html][Emacspeak Manual: URL Templates]]
  25. [[https://www-cs-faculty.stanford.edu/~knuth/taocp.html][The Art Of Computer Programming (TAOCP)]]
  
#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title:  Emacspeak:  A Speech Odyssey
#+KEYWORDS: Emacspeak, Complete Audio Desktop
#+DESCRIPTION: Emacspeak  --- A Speech Odyssey --- Emacspeak At Thirty
#+author: T.V Raman
#+email: raman@google.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 31.0.50 (Org mode 9.7.6)
#+date: Thursday, August 1, 2024
#+latex_header: \usepackage[scaled]{helvet} \renewcommand\familydefault{\sfdefault} 
#+cite_export:
