announcements/now-thirty.tex
\section{Mashing It Up —  Leveraging  AI And The Web}
\label{sec:org32b1d32}

\begin{enumerate}
\item Developing solutions by combining various API-based services on
the Web has all but disappeared, unless one is willing to commit
fully to the Javascript-powered Web hosted in a Web browser,
something I hope I never have to accept.
\item So for now, I'll keep
well away and count my blessings.
\item The next chapter of the \emph{mash-up story} may well be based around
 \emph{Generative AI} using LLMs. In effect, LLMs trained on   Web content 
define a \emph{platform} for generating content mash-ups.  The issue
at present is that they are just as  likely  to produce
\emph{meaningless mush} ---
something that may  get better as the field gets a
handle on cleaning up  Web content.
\item Notice that we are now back to the previously unsolved problem
of cleaning up the  HTML Web --- with LLMs, we'll just
have an order of magnitude more documents than the \emph{2\textsuperscript{W}} postulated
 by  \href{https://research.google/blog/beyond-web-20/?hl=in\&m=1}{Beyond Web 2.0, Communications
Of The ACM, 2009}.
\end{enumerate}
\section{The Final Word --- Donald E Knuth (DEK)}
\label{sec:org0514992}

\begin{itemize}
\item The best theory is inspired by practice. The best practice is
inspired by theory.
\item The enjoyment of one's tools is an essential ingredient of
successful work.
\item Easy things are often amusing and relaxing, but their value soon
fades. Greater pleasure, deeper satisfaction, and higher wages are
associated with genuine accomplishments, with the successful
fulfillment of a challenging task.
\item \href{https://www.azquotes.com/author/8177-Donald\_Knuth}{Computer Programming Is An Art}.
\end{itemize}

The best example of the above is of course \href{https://en.wikipedia.org/wiki/TeX}{Knuth's \TeX{}} --- work that
    was motivated  by his own dissatisfaction with the tools available
    to him at the time for typesetting    his magnum opus --- \href{https://www-cs-faculty.stanford.edu/\~knuth/taocp.html}{The Art
    Of Computer Programming (TAOCP)}.  It is something I've looked up
    to ever since my time as a graduate student at Cornell.


The  Emacspeak Speech Odyssey outlined in this paper is, in some
small measure, my own personal
experience of the sentiments he expresses.

--T. V. Raman,  San Jose, CA, August 1, 2024.
\section{References}
\label{sec:org40f39be}

\begin{enumerate}
\item \href{https://www.drdobbs.com:443/user-interface-a-means-to-an-end/184410453}{User Interface is a means to an end, DDJ 1997}.
\item \href{https://www.gnu.org/s/emacs/}{GNU Emacs}
\item \href{https://en.wikipedia.org/wiki/TeX}{Knuth's \TeX{}}
\item \href{https://emacspeak.blogspot.com/2022/12/aster-spoken-math-on-emacspeak-audio\_21.html}{Audio System For Technical Readings}
\item \href{https://tvraman.github.io/emacspeak//web/releases/release-3.0.html}{Announcing Emacspeak: April 1995}
\item \href{https://emacspeak.sourceforge.net/turning-twenty.html}{Emacspeak At Twenty}
\item \href{http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=636}{The Web, The Way You Want.  Distinguished Lecture Series, UW Oct 2007}
\item \href{https://emacspeak.sourceforge.net/raman/publications/specialized-browsers/}{Specialized Browsers}
\item \href{https://tvraman.github.io/emacspeak/web/01-gemini.ogg}{An Ode To Emacspeak: The Best Is Yet To Come}
\item \href{https://github.com/dectalk/dectalk.git}{Software Dectalk on Github}
\item \href{https://raw.githubusercontent.com/tvraman/emacspeak/master/servers/software-dtk/Readme.org}{Dectalk  setup instructions}
\item \href{https://emacspeak.blogspot.com/2018/06/effective-suggest-and-complete-in-eyes.html}{Effective Suggest And Complete In An Eyes-free Environment}
\item \href{https://asdf.common-lisp.dev/asdf.html}{Common Lisp: asdf}
\item \href{https://www.quicklisp.org/}{Common Lisp: Quicklisp}
\item \href{https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html}{Soundscapes on the Emacspeak Audio Desktop}
\item \href{https://en.wikipedia.org/wiki/REST}{RESTful Web}
\item \href{https://emacspeak.blogspot.com/2023/09/emacs-ergonomics-dont-punish-your.html}{Ergonomic keybindings}
\item \href{https://github.com/alols/xcape}{Minimize chording with XCape}
\item \href{https://emacspeak.blogspot.com/2022/10/learn-smarter-by-taking-rich-hypertext.html}{Learn Smarter By Taking Rich Hypertext Notes}
\item \href{https://idlewords.com/talks/website\_obesity.htm}{Tag Soup, Scripts And Obfuscation: How The Web Was Broken}
\item \href{https://github.com/eafer/rdrview}{Readable Web Pages: RDRView}
\item \href{https://emacspeak.blogspot.com/2024/03/updated-smart-media-selector-for-audio.html}{smart media selectors}
\item \href{https://research.google/blog/beyond-web-20/?hl=in\&m=1}{Beyond Web 2.0, Communications Of The ACM, 2009}
\item \href{https://tvraman.github.io/emacspeak/manual/URL-Templates.html}{Emacspeak Manual: URL Templates}
\item \href{http://emacspeak.blogspot.com/2007/07/emacspeak-and-beautiful-code.html}{Beautiful Code}   An overview of the Emacspeak architecture, O'Reilly Media, 2007.
\item \href{https://www-cs-faculty.stanford.edu/\~knuth/taocp.html}{The Art Of Computer Programming (TAOCP)}
\end{enumerate}
\end{document}
